# Pandas

> Pandas is an open source, BSD-licensed library providing high-performance, easy-to-use data structures and data analysis tools for the Python programming language. (http://pandas.pydata.org/)

One of the most popular packages (not only in Python).

Two major data types:
- `Series` -- 1D vector with index
- `Dataframe` -- tabular data

In [1]:
import pandas as pd

### Series

In [2]:
series = pd.Series([1, 3, 5, 8, 90])
series # the first column is an index

0     1
1     3
2     5
3     8
4    90
dtype: int64

In [3]:
print("element with index 2:", series[2]) # can access elements by their index
print("slice of elements with indices [0, 1, 2]:\n{}".format(series[:3])) # slice returne pd.Series

element with index 2: 5
slice of elements with indices [0, 1, 2]:
0    1
1    3
2    5
dtype: int64

In [4]:
# Dose not work: series[-1]
# why? there is no index "-1"

In [5]:
series.values

array([ 1,  3,  5,  8, 90])

In [6]:
series.values[-1] # but, it can work

90

In [7]:
list(series.index)

[0, 1, 2, 3, 4]

In [8]:
# custom index
series.index = ["a", "b", "c", "d", "e"]
series

a     1
b     3
c     5
d     8
e    90
dtype: int64

In [9]:
series[0]

1

In [10]:
series["a"]

1

### DataFrame

In [11]:
df = pd.DataFrame({
    "col1": [3, 1, 4, 1, 5, 9],
    "col2": ["The", "quick", "brown", "fox", "jumps", "over"]
})
df

   col1   col2
0     3    The
1     1  quick
2     4  brown
3     1    fox
4     5  jumps
5     9   over

In [12]:
# df[2] does not work
df.loc[2]

col1        4
col2    brown
Name: 2, dtype: object

In [13]:
df.loc[2, :]

col1        4
col2    brown
Name: 2, dtype: object

In [14]:
df.index = ["a", "b", "c", "d", "e", "f"]
df.loc["c"]

col1        4
col2    brown
Name: c, dtype: object

In [15]:
df["col1"]

a    3
b    1
c    4
d    1
e    5
f    9
Name: col1, dtype: int64

In [16]:
print("is column a DataFrame?", isinstance(df["col2"], pd.DataFrame))
print("is column a Series?", isinstance(df["col2"], pd.Series))

is column a DataFrame? False
is column a Series? True

### Data handling

In [17]:
df = pd.read_csv("./data/titanic_train.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [18]:
df.shape

(891, 12)

In [19]:
df.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [21]:
# get statistics for numeric columns
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

### Filtering

In [22]:
# filtering dataset
df[df["Age"] > 60].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
33,34,0,2,"Wheadon, Mr. Edward H",male,66.0,0,0,C.A. 24579,10.5000,NaN,S
54,55,0,1,"Ostby, Mr. Engelhart Cornelius",male,65.0,0,1,113509,61.9792,B30,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
170,171,0,1,"Van der hoef, Mr. Wyckoff",male,61.0,0,0,111240,33.5000,B19,S

In [23]:
# another example
df[df["Pclass"] == 1].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S

In [24]:
# combining conditions for filtering
df[(df["Pclass"] == 1) & (df["Embarked"] == "C")].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
30,31,0,1,"Uruchurtu, Don. Manuel E",male,40.0,0,0,PC 17601,27.7208,NaN,C
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
34,35,0,1,"Meyer, Mr. Edgar Joseph",male,28.0,1,0,PC 17604,82.1708,NaN,C
52,53,1,1,"Harper, Mrs. Henry Sleeper (Myna Haxtun)",female,49.0,1,0,PC 17572,76.7292,D33,C

### Divide num & cat columns

In [25]:
import numpy as np

num_cols = []
cat_cols = []
num_types = [int, float]
cat_types = [object]

for k, dtype in enumerate(df.dtypes):
    if dtype in num_types:
        num_cols.append(df.columns[k])
    elif dtype in cat_types:
        cat_cols.append(df.columns[k])
        
num_cols, cat_cols

(['PassengerId', 'Survived', 'Pclass', 'Age', 'SibSp', 'Parch', 'Fare'],
 ['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'])

In [26]:
df[num_cols].head()

   PassengerId  Survived  Pclass   Age  SibSp  Parch     Fare
0            1         0       3  22.0      1      0   7.2500
1            2         1       1  38.0      1      0  71.2833
2            3         1       3  26.0      0      0   7.9250
3            4         1       1  35.0      1      0  53.1000
4            5         0       3  35.0      0      0   8.0500

In [27]:
df[cat_cols].head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

### Groupby

In [28]:
df.groupby("Age").sum()["Survived"].tail()

Age
70.0    0
70.5    0
71.0    0
74.0    0
80.0    1
Name: Survived, dtype: int64

In [29]:
df.groupby(["Pclass", "Sex"]).mean()["Survived"]

Pclass  Sex
1       female    0.968085
        male      0.368852
2       female    0.921053
        male      0.157407
3       female    0.500000
        male      0.135447
Name: Survived, dtype: float64

### check nans

In [30]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

### indexing and slicing

In [31]:
# getting horizontal and vertical slices
df[3:7]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S

In [32]:
# loc = location
df.loc[3:10, ["Name", "Age"]]

                                                 Name   Age
3        Futrelle, Mrs. Jacques Heath (Lily May Peel)  35.0
4                            Allen, Mr. William Henry  35.0
5                                    Moran, Mr. James   NaN
6                             McCarthy, Mr. Timothy J  54.0
7                      Palsson, Master. Gosta Leonard   2.0
8   Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  27.0
9                 Nasser, Mrs. Nicholas (Adele Achem)  14.0
10                    Sandstrom, Miss. Marguerite Rut   4.0

In [33]:
df.loc[:, ['Name', 'Age', 'Pclass']].sort_values("Name").head()

                                      Name   Age  Pclass
845                    Abbing, Mr. Anthony  42.0       3
746            Abbott, Mr. Rossmore Edward  16.0       3
279       Abbott, Mrs. Stanton (Rosa Hunt)  35.0       3
308                    Abelson, Mr. Samuel  30.0       2
874  Abelson, Mrs. Samuel (Hannah Wizosky)  28.0       2

In [34]:
df.loc[:, ["Name", "Age", "Pclass"]].sort_values(["Name", "Pclass"], ascending=False).head()

                                Name   Age  Pclass
868      van Melkebeke, Mr. Philemon   NaN       3
153  van Billiard, Mr. Austin Blyler  40.5       3
361        del Carlo, Mr. Sebastiano  29.0       2
282        de Pelsmaeker, Mr. Alfons  16.0       3
286          de Mulder, Mr. Theodore  30.0       3

In [35]:
df["Age"].isnull().sum()

177

In [36]:
# ex. load Titanic dataset, ['Age'] replace missing values in a column by the mean column value.
df1 = pd.read_csv("./data/titanic_train.csv")
age_mean = df1["Age"].mean()
null_indices = df1.index[df1["Age"].isnull() == True]

df1["Age"][df1["Age"].isnull()] = age_mean

print("The number of null in Age column:", df1["Age"].isnull().sum())
print("Mean value of Age column:", age_mean)
print("Mean value for replaced mv rows", df1.loc[null_indices, "Age"].mean())

The number of null in Age column: 0
Mean value of Age column: 29.69911764705882
Mean value for replaced mv rows 29.699117647058817

/Users/jkpark/.pyenv/versions/3.7.6/envs/ml3/lib/python3.7/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [37]:
# ex. load Titanic dataset, remove samples (rows) that have missing values.
df2 = pd.read_csv("./data/titanic_train.csv")

good_indices = []
for idx in range(len(df2)):
    if True in df2.isnull().loc[idx].values:
        pass
    else:
        good_indices.append(idx)
        
df_new = df2.loc[good_indices, :]
df_new.shape

(183, 12)

In [38]:
df2.dropna(axis=0).shape

(183, 12)

In [39]:
df_new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 183 entries, 1 to 889
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  183 non-null    int64
 1   Survived     183 non-null    int64
 2   Pclass       183 non-null    int64
 3   Name         183 non-null    object
 4   Sex          183 non-null    object
 5   Age          183 non-null    float64
 6   SibSp        183 non-null    int64
 7   Parch        183 non-null    int64
 8   Ticket       183 non-null    object
 9   Fare         183 non-null    float64
 10  Cabin        183 non-null    object
 11  Embarked     183 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 18.6+ KB